from fastapi import FastAPI
from fastapi.middleware.cors import CORSMiddleware

app = FastAPI()

# CORS settings to allow all origins (you can modify this as needed)
app.add_middleware(
    CORSMiddleware,
    allow_origins=["*"],
    allow_methods=["*"],
    allow_headers=["*"],
)

news_items = [
    {
        "id": 5180,
        "link": "https://olympiadaraku.ir/%d8%af%d8%a7%d9%86%d8%b4%da%af%d8%a7%d9%87-%d9%81%d8%b1%d9%87%d9%86%da%af%db%8c%d8%a7%d9%86-%d8%a7%d8%b3%d8%aa%d8%a7%d9%86-%d9%85%d8%b1%da%a9%d8%b2%db%8c-%d9%81%d8%a7%d8%aa%d8%ad-%d8%a7%d9%84%d9%85/",
        "a_title": "دانشگاه فرهنگیان استان مرکزی فاتح المپیاد ورزش های همگانی دانشجویان پسر",
        "description": "به گزارش کمیته تبلیغات المپیاد ششم، پس از چهار روز پیاپی مسابقات در هفت رشته مختلف،پیروز نهایی المپیاد ورزش های همگانی ششم مشخص شد. دانشگاه فرهنگیان استان مرکزی، از دیگر استان ها پیشی گرفت و سکوی اول رقابت های ورزش های همگانی را ازآن خود کرد. دکتر مستعان، معاون دانشجویی و سرپرست کل مسابقات در حاشیه مراسم اختتامیه المپیاد اظهار کرد: قریب به صد دانشگاه و به مدت ۴ روز متوالی در دهکده المپیاد دانشگاه اراک به رقابت پرداختند. وی افزود: این مسابقات در اکثر رشته ها به صورت تیمی و انفرادی برگزار شد که در پایان دانشگاه فرهنگیان استان مرکزی، دانشگاه فنی و حرفه ای استان آذربایجان شرقی و دانشگاه فرهنگیان استان کرمانشاه به تربیت رده های اول تا سوم المپیاد ششم را کسب کردند. معاون دانشجویی دانشگاه اراک، ضمن اشاره به روند برگزاری مسابقات، تیم های برتر هر رشته را به شرح زیر اعلام کرد: در رشته آمادگی جسمانی این رقابت ها دانشگاه های فنی و حرفه ای تبریز و فرهنگیان کرمانشاه ، در دو روز پیاپی رقابت خوش درخشیدند. در رقابت های هندپلو، تیم دانشگاه اراک بر رقبای خود پیروز و مقام قهرمانی را کسب کرد. در رقابت های فریزبی دانشگاه فنی حرفه ای کرمان مقام اول را ازان خود کرد. تیم هفت سنگ مهارتی دانشگاه فرهنگیان خراسان رضوی مقام اول و در رشته طناب زنی دانشگاه بین المللی امام رضا رتبه اول را کسب نمود. و در مسابقات دوچرخه سواری دانشگاه علمی کاربردی شهر اراک فاتح این رقابت ها شد. وی در پایان ضمن تشکر از کادر اجرایی المپیاد ششم تصریح کرد: بدون شک اگر تلاش های فداکارانه همکاران من و دانشجویان گرانقدر دانشگاه اراک نبود، میزبانی المپیاد میسر نبود.",
        "img_src": "https://olympiadaraku.ir/wp-content/uploads/elementor/thumbs/IMG_7919-scaled-q9les3tmuorj8fi0sbstrx6ll7qowglkwr6lf8g7zk.jpg",
        "img_title": "IMG_7919",
        "date": "1402/04/27"
    },
    {
        "id": 5180,
        "link": "https://olympiadaraku.ir/%d8%af%d8%a7%d9%86%d8%b4%da%af%d8%a7%d9%87-%d9%81%d8%b1%d9%87%d9%86%da%af%db%8c%d8%a7%d9%86-%d8%a7%d8%b3%d8%aa%d8%a7%d9%86-%d9%85%d8%b1%da%a9%d8%b2%db%8c-%d9%81%d8%a7%d8%aa%d8%ad-%d8%a7%d9%84%d9%85/",
        "a_title": "دانشگاه فرهنگیان استان مرکزی فاتح المپیاد ورزش های همگانی دانشجویان پسر",
        "description": "به گزارش کمیته تبلیغات المپیاد ششم، پس از چهار روز پیاپی مسابقات در هفت رشته مختلف،پیروز نهایی المپیاد ورزش های همگانی ششم مشخص شد. دانشگاه فرهنگیان استان مرکزی، از دیگر استان ها پیشی گرفت و سکوی اول رقابت های ورزش های همگانی را ازآن خود کرد. دکتر مستعان، معاون دانشجویی و سرپرست کل مسابقات در حاشیه مراسم اختتامیه المپیاد اظهار کرد: قریب به صد دانشگاه و به مدت ۴ روز متوالی در دهکده المپیاد دانشگاه اراک به رقابت پرداختند. وی افزود: این مسابقات در اکثر رشته ها به صورت تیمی و انفرادی برگزار شد که در پایان دانشگاه فرهنگیان استان مرکزی، دانشگاه فنی و حرفه ای استان آذربایجان شرقی و دانشگاه فرهنگیان استان کرمانشاه به تربیت رده های اول تا سوم المپیاد ششم را کسب کردند. معاون دانشجویی دانشگاه اراک، ضمن اشاره به روند برگزاری مسابقات، تیم های برتر هر رشته را به شرح زیر اعلام کرد: در رشته آمادگی جسمانی این رقابت ها دانشگاه های فنی و حرفه ای تبریز و فرهنگیان کرمانشاه ، در دو روز پیاپی رقابت خوش درخشیدند. در رقابت های هندپلو، تیم دانشگاه اراک بر رقبای خود پیروز و مقام قهرمانی را کسب کرد. در رقابت های فریزبی دانشگاه فنی حرفه ای کرمان مقام اول را ازان خود کرد. تیم هفت سنگ مهارتی دانشگاه فرهنگیان خراسان رضوی مقام اول و در رشته طناب زنی دانشگاه بین المللی امام رضا رتبه اول را کسب نمود. و در مسابقات دوچرخه سواری دانشگاه علمی کاربردی شهر اراک فاتح این رقابت ها شد. وی در پایان ضمن تشکر از کادر اجرایی المپیاد ششم تصریح کرد: بدون شک اگر تلاش های فداکارانه همکاران من و دانشجویان گرانقدر دانشگاه اراک نبود، میزبانی المپیاد میسر نبود.",
        "img_src": "https://olympiadaraku.ir/wp-content/uploads/elementor/thumbs/IMG_7919-scaled-q9les3tmuorj8fi0sbstrx6ll7qowglkwr6lf8g7zk.jpg",
        "img_title": "IMG_7919",
        "date": "1402/04/27"
    },
]

results_items = [
    {
        "id": "a9cd979",
        "game_name": "آمادگی جسمانی",
        "game_icon": "fa-running",
        "table_title": [""],
        "rows": [
            [
                ["روز اول", "فردی", "فنی‌حرفه‌ای تبریز", "فرهنگیان مرکزی", "فنی‌حرفه‌ای تبریز"],
                ["روز اول", "فردی", "شایان ساعی دینور", "محمدرضا مومیومند", "قهرمان ماهی چلیک"],
                ["روز اول", "تیمی", "فنی‌حرفه‌ای تبریز", "فرهنگیان اردبیل", "صنعتی شریف"],
                ["روز دوم", "فردی", "فرهنگیان مرکزی", "فرهنگیان کرمانشاه", "فرهنگیان اردبیل"],
                ["روز دوم", "فردی", "محمدرضا مومیوند", "امیرحسین علایی", "مهدی آقاپور"],
                ["روز دوم", "تیمی", "فرهنگیان کرمانشاه", "فرهنگیان مرکزی", "صنعتی شریف"]
            ]
        ]
    },
    {
        "id": "aaf7693",
        "game_name": "دوچرخه‌سواری",
        "game_icon": "fa-bicycle",
        "table_title": ["نتایج تیمی", "نتایج فردی"],
        "rows": [
            [
                ["دانشگاه", "امتیاز اول", "امتیاز دوم", "مجموع", "مقام"], 
                ["دانشگاه کاشان", "۱۰۰", "۰", "۱۰۰", "۲"]
            ], 
            [
                ["نام", "نام‌خانوادگی", "دانشگاه", "شماره", "زمان", "مقام", "امتیاز"],
                ["محمد حسین", "رضازاده", "دانشگاه کاشان", "6A", "۴:۴۶:۶۱۲", "۱", "۱۰۰"]
            ]
        ]
    },
]

games_items = [
    {
        "id": "1",
        "name": "بسکتبال",
        "icon": "fa-basketball-ball",
        "description": "مسابقات طبق شرایط محل برگزاری درعرض قسمت کم عمق استخر برگزار می گردد. نیمه زمین با علامتی بر روی دیواره یا بیرون قسمت کم عمق در عرض مشخص می شود.بازی در دو وقت ۱۵ دقیقه ای روان به عالوه وقت تلف شده به تشخیص داور و با توپ کوچک واترپلو برگزار می شود. در صورت تساوی، تیمی برنده است که اولین گل را در دو وقت اضافه ۵ دقیقه ای وارد دروازه حریف نماید. پس از پایان وقت اضافه اگر توپی وارد دروازه ها نشد، هر تیم باید ۳ پنالتی به صورت تناوبی از فاصله ۵ متری دروازه با اجازه داور اجرا کند. بعد از پنالتی اگر باز هم نتیجه مساوی شد پنالتی ها یک به یک به صورت تناوبی اجرا خواهد شد تا تیم برنده مشخص شود.",
        "img_src": "https://olympiadaraku.ir/wp-content/uploads/2017/06/hand-throwing-dart-arrow-board-360x320.jpg"
    },
    {
        "id": "2",
        "name": "ژیمناستیک",
        "icon": "fa-child",
        "description": "مسابقات طبق شرایط محل برگزاری درعرض قسمت کم عمق استخر برگزار می گردد. نیمه زمین با علامتی بر روی دیواره یا بیرون قسمت کم عمق در عرض مشخص می شود.بازی در دو وقت ۱۵ دقیقه ای روان به عالوه وقت تلف شده به تشخیص داور و با توپ کوچک واترپلو برگزار می شود. در صورت تساوی، تیمی برنده است که اولین گل را در دو وقت اضافه ۵ دقیقه ای وارد دروازه حریف نماید. پس از پایان وقت اضافه اگر توپی وارد دروازه ها نشد، هر تیم باید ۳ پنالتی به صورت تناوبی از فاصله ۵ متری دروازه با اجازه داور اجرا کند. بعد از پنالتی اگر باز هم نتیجه مساوی شد پنالتی ها یک به یک به صورت تناوبی اجرا خواهد شد تا تیم برنده مشخص شود.",
        "img_src": "https://olympiadaraku.ir/wp-content/uploads/2017/06/hand-throwing-dart-arrow-board-360x320.jpg"
    },
    {
        "id": "3",
        "name": "هندبال",
        "icon": "fa-volleyball-ball",
        "description": "مسابقات طبق شرایط محل برگزاری درعرض قسمت کم عمق استخر برگزار می گردد. نیمه زمین با علامتی بر روی دیواره یا بیرون قسمت کم عمق در عرض مشخص می شود.بازی در دو وقت ۱۵ دقیقه ای روان به عالوه وقت تلف شده به تشخیص داور و با توپ کوچک واترپلو برگزار می شود. در صورت تساوی، تیمی برنده است که اولین گل را در دو وقت اضافه ۵ دقیقه ای وارد دروازه حریف نماید. پس از پایان وقت اضافه اگر توپی وارد دروازه ها نشد، هر تیم باید ۳ پنالتی به صورت تناوبی از فاصله ۵ متری دروازه با اجازه داور اجرا کند. بعد از پنالتی اگر باز هم نتیجه مساوی شد پنالتی ها یک به یک به صورت تناوبی اجرا خواهد شد تا تیم برنده مشخص شود.",
        "img_src": "https://olympiadaraku.ir/wp-content/uploads/2017/06/hand-throwing-dart-arrow-board-360x320.jpg"
    },
    ]

dormitories_items = [
    {
        "name": "خوابگاه شهید دکتر فخری زاده",
        "img_src": "https://olympiadaraku.ir/wp-content/uploads/elementor/thumbs/shahid-fakhrizadeh-1-scaled-2048x2048-1-q805uclii33t4y2k7o2bwgh7cfblr8j2vr8vb89t9s.jpg",
        "description": "خوابگاه شهید فخری زاده واقع در پردیس سردشت دانشگاه اراک پذیرای ورزشکاران ششمین دوره المپیاد ورزش های همگانی کشور میباشد ...",
        "direction_link": "https://www.google.nl/maps/dir//Arak%D8%8C+%D8%A7%D8%B1%D8%A7%D9%83%D8%8C+%D8%B3%D8%B1%D8%AF%D8%B4%D8%AA%D8%8C+%D8%AF%D8%A7%D9%86%D8%B4%DA%AF%D8%A7%D9%87%D8%8C+3JHG%2BH99+%D8%AE%D9%88%D8%A7%D8%A8%DA%AF%D8%A7%D9%87+%D8%B4%D9%87%D9%8A%D8%AF+%D9%81%D8%AE%D8%B1%D9%8A+%D8%B2%D8%A7%D8%AF%D9%87,+Iran%E2%80%AD/@34.0786317,49.6260047,17.19z/data=!4m8!4m7!1m0!1m5!1m1!1s0x3feceb5f92c8ed9f:0x6122fa43ad80639b!2m2!1d49.6259931!2d34.0789157?entry=ttu"
    },
    {
        "name": "خوابگاه شهید دکتر فخری زاده",
        "img_src": "https://olympiadaraku.ir/wp-content/uploads/elementor/thumbs/shahid-fakhrizadeh-1-scaled-2048x2048-1-q805uclii33t4y2k7o2bwgh7cfblr8j2vr8vb89t9s.jpg",
        "description": "خوابگاه شهید فخری زاده واقع در پردیس سردشت دانشگاه اراک پذیرای ورزشکاران ششمین دوره المپیاد ورزش های همگانی کشور میباشد ...",
        "direction_link": "https://www.google.nl/maps/dir//Arak%D8%8C+%D8%A7%D8%B1%D8%A7%D9%83%D8%8C+%D8%B3%D8%B1%D8%AF%D8%B4%D8%AA%D8%8C+%D8%AF%D8%A7%D9%86%D8%B4%DA%AF%D8%A7%D9%87%D8%8C+3JHG%2BH99+%D8%AE%D9%88%D8%A7%D8%A8%DA%AF%D8%A7%D9%87+%D8%B4%D9%87%D9%8A%D8%AF+%D9%81%D8%AE%D8%B1%D9%8A+%D8%B2%D8%A7%D8%AF%D9%87,+Iran%E2%80%AD/@34.0786317,49.6260047,17.19z/data=!4m8!4m7!1m0!1m5!1m1!1s0x3feceb5f92c8ed9f:0x6122fa43ad80639b!2m2!1d49.6259931!2d34.0789157?entry=ttu"
    },
]

gyms_items = [
    {
        "name": "استخر آفتاب",
        "img_src": "https://olympiadaraku.ir/wp-content/uploads/elementor/thumbs/IMG_2627-scaled-1-1-q852ojua95ye4et42hs6cyvuih4kg3wo5izdjd1j74.jpg",
        "description": "استخر آفتاب واقع در پردیس سردشت دانشگاه اراک میزبان دانشجویان پسر سراسر کشور در رشته ورزشی هندپلو میباشد.",
        "direction_link": "https://www.google.nl/maps/dir//Markazi+Province,+Arak,+%D8%AF%D8%A7%D9%86%D8%B4%DA%AF%D8%A7%D9%87+%D8%A7%D8%B1%D8%A7%DA%A9%D8%8C%D8%A7%D8%B1%D8%A7%DA%A9%D8%8C%D8%A7%D8%B3%D8%AA%D8%A7%D9%86+%D9%85%D8%B1%DA%A9%D8%B2%DB%8C%D8%8C,+%D8%A7%D8%B3%D8%AA%D8%AE%D8%B1+%D8%A2%D9%81%D8%AA%D8%A7%D8%A8+%D8%AF%D8%A7%D9%86%D8%B4%DA%AF%D8%A7%D9%87+%D8%A7%D8%B1%D8%A7%DA%A9,+%D8%A7%D8%B3%D8%AA%D8%AE%D8%B1+%D8%AF%D8%A7%D9%86%D8%B4%DA%AF%D8%A7%D9%87+%D8%A7%D8%B1%D8%A7%DA%A9%D8%8C+Iran%E2%80%AD/@34.0761428,49.6332264,18z/data=!4m8!4m7!1m0!1m5!1m1!1s0x3fec9502623a755d:0x5079b9855bb4fe7f!2m2!1d49.6343902!2d34.0764203?entry=ttu"
    },
    {
        "name": "استخر آفتاب",
        "img_src": "https://olympiadaraku.ir/wp-content/uploads/elementor/thumbs/IMG_2627-scaled-1-1-q852ojua95ye4et42hs6cyvuih4kg3wo5izdjd1j74.jpg",
        "description": "استخر آفتاب واقع در پردیس سردشت دانشگاه اراک میزبان دانشجویان پسر سراسر کشور در رشته ورزشی هندپلو میباشد.",
        "direction_link": "https://www.google.nl/maps/dir//Markazi+Province,+Arak,+%D8%AF%D8%A7%D9%86%D8%B4%DA%AF%D8%A7%D9%87+%D8%A7%D8%B1%D8%A7%DA%A9%D8%8C%D8%A7%D8%B1%D8%A7%DA%A9%D8%8C%D8%A7%D8%B3%D8%AA%D8%A7%D9%86+%D9%85%D8%B1%DA%A9%D8%B2%DB%8C%D8%8C,+%D8%A7%D8%B3%D8%AA%D8%AE%D8%B1+%D8%A2%D9%81%D8%AA%D8%A7%D8%A8+%D8%AF%D8%A7%D9%86%D8%B4%DA%AF%D8%A7%D9%87+%D8%A7%D8%B1%D8%A7%DA%A9,+%D8%A7%D8%B3%D8%AA%D8%AE%D8%B1+%D8%AF%D8%A7%D9%86%D8%B4%DA%AF%D8%A7%D9%87+%D8%A7%D8%B1%D8%A7%DA%A9%D8%8C+Iran%E2%80%AD/@34.0761428,49.6332264,18z/data=!4m8!4m7!1m0!1m5!1m1!1s0x3fec9502623a755d:0x5079b9855bb4fe7f!2m2!1d49.6343902!2d34.0764203?entry=ttu"
    },
]

timing_competitions_items = [
    {
        
    },
]

@app.get("/news_items/")
async def ret_news_item():
    return news_items

@app.get("/results_items/")
async def ret_results_item():
    return results_items

@app.get("/games_items/")
async def ret_results_item():
    return games_items

@app.get("/dormitories_items/")
async def ret_results_item():
    return dormitories_items

@app.get("/gyms_items/")
async def ret_results_item():
    return gyms_items

@app.get("/timing_competitions_items/")
async def ret_results_item():
    return timing_competitions_items
