// var url = API + 'news_items/';
//
// fetch(url)
//     .then(response => response.json())
//     .then(data => {
//         if ((typeof data['data'] !== 'undefined') && (data['data'].length > 0)) {
//             appendNews(data['data']);
//         }
//     });


data = {
    "data": [
        {
            "type": "News",
            "id": "1",
            "attributes": {
                "title": "اولین جلسه هماهنگی میزبانی تهران در چهارمین المپیاد استعدادهای برتر رشته شنا ، شیرجه و واترپلو",
                "description": "اولین جلسه هماهنگی میزبانی تهران در چهارمین المپیاد استعدادهای برتر رشته شنا ، شیرجه و واترپلو با حضور ایرجی معاون ورزشی اداره کل ، علی آبادی نائب رئیس ، بیداریان دبیر فدراسیون ، نظر سرپرست هئیت شنای استان تهران و قمی رئیس گروه همگانی اداره کل برگزار شد.",
                "image": "http://79.127.120.164:2699/uploads/05_02.jpg",
                "date": "1402/05/02",
                "link": null
            }
        },
        {
            "type": "News",
            "id": "2",
            "attributes": {
                "title": "تشکیل ستاد اجرایی چهارمین المپیاد استعدادهای برتر کشور در تهران",
                "description": "جوادی مدیر کل : برگزاری کیفی باید در دستور کار هیئتهای میزبان قرار گیرد.  با ایجادجدول برنامه ریزی ستاد و استفاده از ظرفیت های موجود، تهران به استقبال از میزبانی  ورزشکاران سراسر کشور خواهد رفت. رقابت‌های اسکیت ، تنیس روی میز، تیراندازی، شنا ، شیرجه و واترپلو، دوومیدانی، جودو ، گلف و قایقرانی در استان تهران برگزار خواهد شد.",
                "image": "http://79.127.120.164:2699/uploads/05_02_2.jpg",
                "date": "1402/05/02",
                "link": null
            }
        },
        {
            "type": "News",
            "id": "3",
            "attributes": {
                "title": "جلسه هماهنگی و برنامه ریزی مطلوب برای رقابت‌های چهارمین دوره المپیاد استعداد های برتر ورزش جودو",
                "description": "این نشست با حضور ایرجی  معاون توسعه ورزش اداره کل بهمراه ترکاشوند رئیس هیئت و قدمی سرپرست دبیری فدارسیون و کمیته های مربوطه اجرایی در محل فدراسیون تشکیل گردید.",
                "image": "http://79.127.120.164:2699/uploads/05_02_3.jpg",
                "date": "1402/05/02",
                "link": null
            }
        },
        {
            "type": "News",
            "id": "4",
            "attributes": {
                "title": "نشست هماهنگی روسای هیتت های ورزشی استان تهران در چهارمین دوره المپیاد استعدادهای برتر کشور",
                "description": "گزارش ایرجی معاون توسعه ورزش از ۱۵ رشته میزبانی در تهران و اقدامات ستاد مرکزی جهت برگزاری مطلوب این رقابت ها.",
                "image": "http://79.127.120.164:2699/uploads/05_10.jpg",
                "date": "1402/05/10",
                "link": null
            }
        },
        {
            "type": "News",
            "id": "5",
            "attributes": {
                "title": "اهدا احکام روسای کمیته‌های اجرایی به فدراسیون کبدی",
                "description": "در پایان ستاد اجرایی المپیاد استعدادهای برتر استان تهران احکام روسای کمیته های اجرایی توسط علی جوادی مدیر کل و اورسجی رئیس فدراسیون کبدی اهداء شد.",
                "image": "http://79.127.120.164:2699/uploads/05_17.jpg",
                "date": "1402/05/17",
                "link": null
            }
        },
        {
            "type": "News",
            "id": "6",
            "attributes": {
                "title": "اعـــزام تیــم نــوجــوانــان استـان تهـــران بــه مســابقــات المپیــاد ورزشــی",
                "description": "تیـم نـــوجــوانـان ورزشهـای زورخـانه ای استـان تهــران به سرپـرستـی *فرشید جلیلی* و مربیگری *علی جلیجو* جهت انجام مسابقات المپیاد ورزشی به استان خراسان اعزام شدند. برای این نوجوان آینده سازِ ورزش زورخانه ای آرزوی سلامتی و موفقیت داریم.",
                "image": "http://79.127.120.164:2699/uploads/05_19.jpg",
                "date": "1402/05/19",
                "link": null
            }
        },
        {
            "type": "News",
            "id": "8",
            "attributes": {
                "title": "بازدید جوادی مدیر کل از شرایط اسکان تیم های واترپلو",
                "description": "بازدید جوادی مدیر کل از شرایط اسکان تیم های واترپلو با همراهی معتمد کیا مدیر کل روابط عمومی وزارت ورزش و جوانان و نظر سرپرست هیئت شنای استان تهران‌ مجموعه آزادی.",
                "image": "http://79.127.120.164:2699/uploads/05_19_2_wLPG9Ga.jpg",
                "date": "1402/05/19",
                "link": null
            }
        },
        {
            "type": "News",
            "id": "9",
            "attributes": {
                "title": "آغاز چهارمین دوره المپیاد استعدادهای برتر واترپلو کشور به میزبانی تهران",
                "description": "آئین افتتاحیه و رژه ۱۰ تیم حاضر در این رقابت ها با حضور علی آبادی نائب رئیس فدراسیون شنا، ایرجی معاون ورزشی اداره کل ورزش و جوانان استان تهران، پیام نظر سرپرست هیات شنای استان تهران، آزاد سرپرست گروه ورزش قهرمانی اداره کل، رحمانیون ستاد برگزاری المپیاد، قمی سرپرست گروه همگانی و ارمیان سرپرست هیات همگانی استان برگزار شد.",
                "image": "http://79.127.120.164:2699/uploads/05_20.jpg",
                "date": "1402/05/20",
                "link": null
            }
        },
        {
            "type": "News",
            "id": "10",
            "attributes": {
                "title": "تهران، نایب قهرمان چهارمین دوره المپیاد استعدادهای برتر ورزش زورخانه‌ای کشور",
                "description": "در چهارمین دوره المپیاد استعدادهای برتر ورزش زورخانه ای کشور گرامیداشت شهدای مدافع حرم، تهران به مقام نایب قهرمانی رسید.  این رقابت ها با شعار \"سریع، قوی تا اوج برای ایران مقتدر\" با حضور ۲۲۱ ورزشکار از ۲۳ استان بین نوجوانان ۱۲ تا ۱۶ سال در رشته های تیمی و مهارت فردی در سالن شهید بهشتی مشهد مقدس برگزار شد و با قهرمانی اصفهان و نایب قهرمانی تهران پایان یافت. خراسان رضوی میزبان مسابقات هم برنده جام اخلاق شد.",
                "image": "http://79.127.120.164:2699/uploads/IMG_20230813_081736_394.jpg",
                "date": "1402/05/21",
                "link": null
            }
        },
        {
            "type": "News",
            "id": "11",
            "attributes": {
                "title": "تهران بر سکوی سوم واترپلو چهارمین دوره المپیاد استعداد های برتر کشور",
                "description": "در پایان سه روز رقابت۱۰ تیم حاضر در این دوره به میزبانی استان تهران یزد به مقام اول رسید، اصفهان دوم شد و تهران مقام سوم را به خود اختصاص داد. توزیع مدال قهرمانان توسط \"علی جوادی\" و نمایندگان وزارت ورزش و جوانان انجام شد.",
                "image": "http://79.127.120.164:2699/uploads/IMG_20230813_115706_922.jpg",
                "date": "1402/05/22",
                "link": null
            }
        },
        {
            "type": "News",
            "id": "12",
            "attributes": {
                "title": "معرفی نفرات برتر چهارمین دوره المپیاد استعدادهای برتر ورزش در رشته اسکیت‌برد پسران",
                "description": "به گزارش روابط عمومی فدراسیون اسکیت ،چهارمین دوره المپیاد استعدادهای برتر ورزش در رشته اسکیت برد بخش آقایان امروز دوشنبه 23 مرداد ماه در  اسکیت پارک لیو تهران با حضور ایرجی معاون توسعه ورزش اداره کل ،مسئولین فدراسیون و هیات اسکیت استان تهران برگزار شد.",
                "image": "http://79.127.120.164:2699/uploads/05_23.jpg",
                "date": "1402/05/23",
                "link": null
            }
        },
        {
            "type": "News",
            "id": "13",
            "attributes": {
                "title": "یکه تازی تهرانی ها در اسکیت برد ‌پسران چهارمین دوره المپیاد استعدادهای برتر ورزش کشور",
                "description": "به گزارش روابط عمومی ستاد برگزاری و میزبانی المپیاد استعدادهای برتر کشور در اداره کل ورزش و جوانان استان تهران، در این دوره از مسابقات که با حضور 31 ورزشکار از 11 استان سراسر کشور به میزبانی هیات اسکیت استان تهران در اسکیت پارک لیو برگزار شد، یامین نوروزی، امیر حسین روستاپور و رادین زارعی هرسه نفر از استان تهران به ترتیب مقام های اول تا سوم را از آن خود کردند.",
                "image": "http://79.127.120.164:2699/uploads/05_23_2.jpg",
                "date": "1402/05/23",
                "link": null
            }
        },
        {
            "type": "News",
            "id": "14",
            "attributes": {
                "title": "مراسم افتتاحیه مسابقات شیرجه چهارمین دوره المپیاد استعدادهای برتر ورزش کشور",
                "description": "آغاز مراسم افتتاحیه رقابت‌های شیرجه چهارمین دوره المپیاد استعدادهای برتر ورزش کشور با حضور ایرجی معاون توسعه امور ورزش اداره کل، پیام نظر سرپرست هیات شنا استان تهران،  مدیران ستادی اداره کل و نمایندگان وزارت ورزش و جوانان در استخر قهرمانی مجموعه ورزشی آزادی.",
                "image": "http://79.127.120.164:2699/uploads/05_24.jpg",
                "date": "1402/05/24",
                "link": null
            }
        },
        {
            "type": "News",
            "id": "15",
            "attributes": {
                "title": "ایرجی معاون توسعه امور ورزش اداره‌کل ورزش و جوانان استان تهران در مراسم افتتاحیه مسابقات شیرجه",
                "description": "ایرجی معاون توسعه امور ورزش اداره‌کل ورزش و جوانان استان تهران در مراسم افتتاحیه مسابقات شیرجه چهارمین دوره المپیاد استعدادهای برتر ورزشی کشور: باید از وزارت ورزش و جوانان تشکر کرد که با همه محدودیت‌ها و زمان‌بندی هایی که برای بازی‌های آسیایی هانگژو وجود دارد، تصمیم گرفت تا مسابقات المپیاد استعدادهای برتر ورزش کشور را برگزار کند/  درواقع نقطه قوت چهارمین دوره المپیاد برگزاری آن است و در زمان بسیار کمی به تیم‌ها فراخوان داده شد. امیدواریم که در دوره‌های بعد شاهد حضور پرشورتر تیم‌های استانی در این رقابت‌ها باشیم.",
                "image": "http://79.127.120.164:2699/uploads/05_24_2.jpg",
                "date": "1402/05/24",
                "link": null
            }
        },
        {
            "type": "News",
            "id": "16",
            "attributes": {
                "title": "معاون توسعه امور ورزش اداره‌کل ورزش و جوانان استان تهران در مراسم افتتاحیه مسابقات شیرجه",
                "description": "معاون توسعه امور ورزش اداره‌کل ورزش و جوانان استان تهران در مراسم افتتاحیه مسابقات شیرجه المپیاد استعدادهای برتر ورزش کشور: از هیات شنای استان تهران و به‌خصوص پیام نظر به دلیل برگزاری این مسابقات کشوری آن‌هم بعد از چند روز از قبول این مسئولیت، قدردانی کرده و به ایشان و همکاران شان خسته نباشید می‌گویم/ امیدوارم در سنوات آینده با مدیریت زمانی بهتر، این مسابقات را به شکل باشکوه‌تری میزبانی کنیم؛ به‌خصوص در شرایط سنی ۱۲ تا ۱۶ سالکه نقطه عطفی در زندگی ورزشکاران این رده سنی است.",
                "image": "http://79.127.120.164:2699/uploads/05_24_3.jpg",
                "date": "1402/05/24",
                "link": null
            }
        },
        {
            "type": "News",
            "id": "17",
            "attributes": {
                "title": "مراسم افتتاحیه رقابتهای شیرجه چهارمین دوره المپیاد استعدادهای برتر ورزش کشور",
                "description": "مراسم افتتاحیه رقابتهای شیرجه چهارمین دوره المپیاد استعدادهای برتر ورزش کشور و  آغاز رقابت شیرجه روهای برتر استان ها به میزبانی هیات شنای استان تهران، امروز سه شنبه در استخر قهرمانی مجموعه ورزشی آزادی",
                "image": "http://79.127.120.164:2699/uploads/05_24_4.jpg",
                "date": "1402/05/24",
                "link": null
            }
        },
        {
            "type": "News",
            "id": "18",
            "attributes": {
                "title": "جلسه هماهنگی میزبانی مسابقات گلف",
                "description": "جلسه هماهنگی هیات گلف استان تهران جهت هرچه باشکوهتر شدن مسابقات گلف چهارمین المپیاد برتر ایرانیان",
                "image": "http://79.127.120.164:2699/uploads/0945b24f-8139-4a83-9184-61a9b7fdd642_1.jpg",
                "date": "گلف",
                "link": null
            }
        },
        {
            "type": "News",
            "id": "19",
            "attributes": {
                "title": "28 مرداد ماه شروع مسابقات دوچرخه سواری در خراسان رضوی",
                "description": "این رقابت ها، در رده سنی نوجوانان دختر و پسر، متولد 86 تا 89 در سطح کشوری و در بین بیش از 30 استان در مشهد مقدس برگزار",
                "image": "http://79.127.120.164:2699/uploads/fe2c6d6c-dd15-4dc8-bb52-85931c1d1739.jpg",
                "date": "28 مرداد",
                "link": null
            }
        },
        {
            "type": "News",
            "id": "20",
            "attributes": {
                "title": "مسابقات ژیمناستیک ترامپولین",
                "description": "تیم های برتر گروه سنی ۱۱ و ۱۲ سال مسابقات ترامپولین المپیاد استعدادهای برتر کشور مشخص شدند به گزارش روابط عمومی‌ فدراسیون ژیمناستیک ، در اولین روز رقابت های ترامپولین ، تیم های هرمزگان ، اصفهان و یزد به ترتیب به مقام های اول تا سوم این رقابت ها را کسب کردند استان‌های اردبیل و آذربایجان شرقی ،همدان و کردستان به ترتیب در جایگاه های پنجم تا هفتم این رقابت ها قرار گرفتند. فینال رقابت های انفرادی این رده سنی روز شنبه با حضور ۸ ژیمناست برتر دور مقدماتی برگزار خواهد شد. چهارمین المپیاد استعدادهای برتر ژیمناستیک کشور در ترامپولین با حضور ۲۰ تیم از استان‌های مختلف از ۲۶ تا ۲۸ مرداد ماه در استان اصفهان برگزار می شود.",
                "image": "http://79.127.120.164:2699/uploads/d56768fd-92ed-488a-a098-5b5a99549197.jpg",
                "date": "26 مرداد",
                "link": null
            }
        },
        {
            "type": "News",
            "id": "21",
            "attributes": {
                "title": "جلسه هماهنگی و بازدید از خوابگاه ،سالن مسابقات شمشیربازی و تنیس روی میز",
                "description": "در جلسه روز شنبه 28 مرداد که با حضور آقایان ایرجی معاونت محترم امور ورزش استان -دکتر میری مدیریت محترم تربیت بدنی داننشگاه امیر کبیر  -صابری رئیس هیات پینگ پنگ و میرزایی رئیس هیات شمشیربازی استان و صفری استعدادیابی استان ،ضمن بازدید از خوابگاه و سالن دانشگاه شهید امیرکبیردر خصوص هر چه باشکوه تر برگزار شدن مراسم به بحث و تبادل نظر پرداختند شروع مسابقات شمشیربازی از تاریخ 7شهریور و تنیس روی میز از 18 شهریور",
                "image": "http://79.127.120.164:2699/uploads/thumbnail_6.jpg",
                "date": "28 مرداد",
                "link": null
            }
        },
        {
            "type": "News",
            "id": "22",
            "attributes": {
                "title": "جلسه هم اندیشی داخل ستادی چهارمین المپیاد استعدادهای برتر",
                "description": "جلسه با حضور دبیر اجرایی ستاد و کارشناسان حوزه ورزش برگزار و مقرر شد با هماهنگی های لازم نسبت به هر چه باشکوهتر برگزار کردن مسابقات تلاش لازم بعمل آید",
                "image": "http://79.127.120.164:2699/uploads/thumbnail_2_0bOkyd5.jpg",
                "date": "29مرداد",
                "link": null
            }
        }
    ]
};

appendNews(data['data'])


function appendNews(data) {
    let mainContainer = document.getElementById("news_page");
    mainContainer.innerHTML = "";
    for (var i = data.length-1; i > 0; i--) {
        data[i] = data[i]['attributes'];
        let article_tag = document.createElement("article");
        let div_tag = document.createElement("div");
        let div2_tag = document.createElement("div");
        let div3_tag = document.createElement("div");
        let a_tag = document.createElement("a");
        let a2_tag = document.createElement("a");
        let a3_tag = document.createElement("a");
        let img_tag = document.createElement("img");
        let h3_tag = document.createElement("h3");
        let span_tag = document.createElement("span");

        article_tag.setAttribute("class", "cz_default_loop clr cz_post_odd post-5180 post type-post status-publish format-standard has-post-thumbnail hentry category-sixth");
        div_tag.setAttribute("class", "clr");

        a_tag.setAttribute("class", "cz_post_image");
        a_tag.setAttribute("href", (data[i].link === null ? "#" : data[i].link));
        img_tag.setAttribute("decoding", "async");
        // img_tag.setAttribute("src", "data:image/svg+xml,%3Csvg%20xmlns%3D&#39;http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg&#39;%20width=&#39;360&#39;%20height=&#39;320&#39;%20viewBox%3D&#39;0%200%20360%20320&#39;%2F%3E");
        // img_tag.setAttribute("data-src",  data[i].image);
        img_tag.setAttribute("src",  data[i].image);
        // img_tag.setAttribute("title", "");
        // img_tag.setAttribute("alt", "");
        img_tag.setAttribute("loading", "lazy");
        img_tag.setAttribute("class", "attachment-codevz_360_320 size-codevz_360_320 wp-post-image");
        img_tag.setAttribute("width", "360");
        img_tag.setAttribute("height", "320");

        div2_tag.setAttribute("class", "cz_post_con");
        a2_tag.setAttribute("class", "cz_post_title");
        a2_tag.setAttribute("href", (data[i].link === null ? "#" : data[i].link));
        h3_tag.innerHTML = data[i].title;

        span_tag.setAttribute("class", "cz_post_inner_meta cz_post_meta mt10 mb10 cz_post_date");
        a3_tag.innerHTML = data[i].date;

        div3_tag.setAttribute("class", "cz_post_excerpt");
        div3_tag.innerHTML = data[i].description;

        span_tag.appendChild(a3_tag);
        a2_tag.appendChild(h3_tag);

        div2_tag.appendChild(a2_tag);
        div2_tag.appendChild(span_tag);
        div2_tag.appendChild(div3_tag);

        a_tag.appendChild(img_tag);
        div_tag.appendChild(a_tag);
        div_tag.appendChild(div2_tag);
        article_tag.appendChild(div_tag);

        mainContainer.appendChild(article_tag);
    }
}